cases/damBreak_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0.000000000 0.000000000 0.000000000)
    (0.292000000 0.000000000 0.000000000)
    (0.316000000 0.000000000 0.000000000)
    (0.584000000 0.000000000 0.000000000)

    (0.000000000 0.048000000 0.000000000)
    (0.292000000 0.048000000 0.000000000)
    (0.316000000 0.048000000 0.000000000)
    (0.584000000 0.048000000 0.000000000)

    (0.000000000 0.584000000 0.000000000)
    (0.292000000 0.584000000 0.000000000)
    (0.316000000 0.584000000 0.000000000)
    (0.584000000 0.584000000 0.000000000)

    (0.000000000 0.000000000 0.014600000)
    (0.292000000 0.000000000 0.014600000)
    (0.316000000 0.000000000 0.014600000)
    (0.584000000 0.000000000 0.014600000)

    (0.000000000 0.048000000 0.014600000)
    (0.292000000 0.048000000 0.014600000)
    (0.316000000 0.048000000 0.014600000)
    (0.584000000 0.048000000 0.014600000)

    (0.000000000 0.584000000 0.014600000)
    (0.292000000 0.584000000 0.014600000)
    (0.316000000 0.584000000 0.014600000)
    (0.584000000 0.584000000 0.014600000)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (46 16 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (38 16 1) simpleGrading (1 1 1)
    hex (4 5 9 8 16 17 21 20) (46 84 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (8 84 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (38 84 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (2 3 15 14)
        );
    }

    obstacle
    {
        type wall;
        faces
        (
            (1 5 17 13)
            (5 6 18 17)
            (2 14 18 6)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

defaultPatch
{
    name defaultFaces;
    type empty;
}

mergePatchPairs
(
);

// ************************************************************************* //
