cases/damBreak_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;

maxAlphaCo      0.25;

maxDeltaT       0.005;

functions
{
    obstaclePressureAverage
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);

        writeControl    adjustableRunTime;
        writeInterval   0.005;
        writeFields     false;

        regionType      patch;
        name            obstacle;

        operation       areaAverage;

        fields
        (
            p_rgh
            alpha.water
        );
    }

    obstaclePressureMaximum
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);

        writeControl    adjustableRunTime;
        writeInterval   0.005;
        writeFields     false;

        regionType      patch;
        name            obstacle;

        operation       max;

        fields
        (
            p_rgh
            alpha.water
        );
    }
}

// ************************************************************************* //
